#+title: Sprint Backlog 00 for Niam
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) epic(e) }

* Mission Statement

- create football manager program

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-02-14 Wed 13:07]
| <75>                                                                        |         |       |      |       |
| Headline                                                                    | Time    |       |      |     % |
|-----------------------------------------------------------------------------+---------+-------+------+-------|
| *Total time*                                                                | *73:30* |       |      | 100.0 |
|-----------------------------------------------------------------------------+---------+-------+------+-------|
| Stories                                                                     | 73:30   |       |      | 100.0 |
| Active                                                                      |         | 73:30 |      | 100.0 |
| STARTED Sprint and product backlog grooming                                 |         |       | 0:58 |   1.3 |
| COMPLETED Add gpg                                                           |         |       | 1:32 |   2.1 |
| COMPLETED Test commits to branch                                            |         |       | 0:28 |   0.6 |
| COMPLETED Test verification                                                 |         |       | 0:21 |   0.5 |
| COMPLETED Practice branches                                                 |         |       | 1:05 |   1.5 |
| COMPLETED Fix travis                                                        |         |       | 0:33 |   0.7 |
| COMPLETED Create main                                                       |         |       | 0:26 |   0.6 |
| COMPLETED Build main                                                        |         |       | 2:10 |   2.9 |
| COMPLETED Discuss task                                                      |         |       | 0:31 |   0.7 |
| COMPLETED Create a Menu class                                               |         |       | 0:52 |   1.2 |
| COMPLETED Fix menu class                                                    |         |       | 1:41 |   2.3 |
| COMPLETED Research classes                                                  |         |       | 1:49 |   2.5 |
| COMPLETED Add new option to list                                            |         |       | 0:19 |   0.4 |
| COMPLETED Create players class                                              |         |       | 0:21 |   0.5 |
| POSTPONED Fix player class                                                  |         |       | 2:00 |   2.7 |
| STARTED create setup function in player class                               |         |       | 1:30 |   2.0 |
| STARTED create display function in player class                             |         |       | 0:20 |   0.5 |
| COMPLETED Create vector for players                                         |         |       | 1:00 |   1.4 |
| COMPLETED Read through fixed player class                                   |         |       | 1:07 |   1.5 |
| COMPLETED Research classes                                                  |         |       | 2:56 |   4.0 |
| COMPLETED Dealing with conflicts in magit                                   |         |       | 2:19 |   3.2 |
| COMPLETED Practice implementing class with functions                        |         |       | 0:26 |   0.6 |
| COMPLETED Research classes                                                  |         |       | 1:41 |   2.3 |
| COMPLETED Add detail to players                                             |         |       | 1:00 |   1.4 |
| COMPLETED Add new player                                                    |         |       | 0:46 |   1.0 |
| COMPLETED Show detail of select player only                                 |         |       | 0:29 |   0.7 |
| COMPLETED Discuss task                                                      |         |       | 0:33 |   0.7 |
| COMPLETED Add the rest of the players                                       |         |       | 0:39 |   0.9 |
| COMPLETED Testing program                                                   |         |       | 1:00 |   1.4 |
| COMPLETED Learning about pointers- videos                                   |         |       | 1:00 |   1.4 |
| COMPLETED Pointers - research                                               |         |       | 1:30 |   2.0 |
| COMPLETED Pointers - tutorials                                              |         |       | 1:00 |   1.4 |
| COMPLETED Pointers - examples                                               |         |       | 0:45 |   1.0 |
| COMPLETED Pointers - program                                                |         |       | 0:46 |   1.0 |
| COMPLETED Testing program                                                   |         |       | 0:45 |   1.0 |
| COMPLETED Discussing program                                                |         |       | 0:30 |   0.7 |
| COMPLETED Review pointers                                                   |         |       | 1:00 |   1.4 |
| COMPLETED Research pointers to data structures                              |         |       | 1:01 |   1.4 |
| COMPLETED Pointers with array program                                       |         |       | 0:56 |   1.3 |
| COMPLETED Data structures reading                                           |         |       | 0:54 |   1.2 |
| COMPLETED Pointers and classes                                              |         |       | 1:00 |   1.4 |
| COMPLETED Pointers and classes program                                      |         |       | 0:34 |   0.8 |
| COMPLETED Review                                                            |         |       | 0:44 |   1.0 |
| COMPLETED Discussing tasks                                                  |         |       | 0:07 |   0.2 |
| COMPLETED Pointers practice                                                 |         |       | 1:11 |   1.6 |
| COMPLETED Pointers, classes, - employee program                             |         |       | 0:56 |   1.3 |
| COMPLETED Split employee program up                                         |         |       | 1:14 |   1.7 |
| COMPLETED Looking at PGs program                                            |         |       | 0:28 |   0.6 |
| COMPLETED Testing employee program                                          |         |       | 1:04 |   1.5 |
| COMPLETED comparing w/ PG                                                   |         |       | 0:23 |   0.5 |
| COMPLETED Add another function to employee program                          |         |       | 1:09 |   1.6 |
| COMPLETED Research class constructors                                       |         |       | 1:00 |   1.4 |
| COMPLETED Help PG split files                                               |         |       | 0:28 |   0.6 |
| COMPLETED Class constructor and multiple files Video                        |         |       | 0:54 |   1.2 |
| COMPLETED Make another object                                               |         |       | 0:23 |   0.5 |
| COMPLETED Allow user to add employee/object                                 |         |       | 0:56 |   1.3 |
| COMPLETED Discuss tasks                                                     |         |       | 0:30 |   0.7 |
| COMPLETED Research tasks                                                    |         |       | 0:36 |   0.8 |
| COMPLETED Watch classes video                                               |         |       | 0:53 |   1.2 |
| COMPLETED Employee IO program                                               |         |       | 1:03 |   1.4 |
| COMPLETED Test Employee IO program                                          |         |       | 1:00 |   1.4 |
| COMPLETED Review player class in FM                                         |         |       | 0:38 |   0.9 |
| COMPLETED Discuss tasks                                                     |         |       | 0:13 |   0.3 |
| COMPLETED Discuss code                                                      |         |       | 0:40 |   0.9 |
| COMPLETED Read about Object oriented programming                            |         |       | 0:42 |   1.0 |
| COMPLETED Start league class                                                |         |       | 0:48 |   1.1 |
| COMPLETED Add league class to main                                          |         |       | 0:30 |   0.7 |
| COMPLETED Discuss tasks                                                     |         |       | 0:30 |   0.7 |
| COMPLETED Review changes                                                    |         |       | 1:06 |   1.5 |
| COMPLETED Add more team data to league                                      |         |       | 0:37 |   0.8 |
| COMPLETED Testing                                                           |         |       | 1:02 |   1.4 |
| COMPLETED Review code/research tasks                                        |         |       | 1:01 |   1.4 |
| COMPLETED Start game class                                                  |         |       | 1:00 |   1.4 |
| COMPLETED Discuss game and look through code                                |         |       | 1:19 |   1.8 |
| COMPLETED Add game to main                                                  |         |       | 0:23 |   0.5 |
| COMPLETED Read MC sample game                                               |         |       | 0:25 |   0.6 |
| COMPLETED Build and test MC game                                            |         |       | 1:00 |   1.4 |
| COMPLETED Research parts of code                                            |         |       | 0:33 |   0.7 |
| COMPLETED Research IO/Myfile                                                |         |       | 0:40 |   0.9 |
| COMPLETED Review sample program                                             |         |       | 2:00 |   2.7 |
| COMPLETED Fix league class                                                  |         |       | 0:51 |   1.2 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:


*** STARTED Sprint and product backlog grooming                       :story:
    CLOCK: [2018-01-30 Tue 09:00]--[2018-01-30 Tue 09:58] =>  0:58

Updates to sprint and product backlog

*** COMPLETED Magit
    CLOSED: [2018-01-30 Tue 09:20]

Simple branching workflow:

 - make sure you have ido-mode on as it makes it much easier to select
   the branches.
 - create a new branch in magit: Type b c. The starting point should be
   master. Then give it a name (e.g. development).
 - do work as usual, commit etc. When you want to push:
   1. first make sure all files have been either committed or stashed.
   2. Then in magit type b b master to change to master.
   3. Then pull master with F u.
   4. Then go back to your branch with b b development.
   5. Rebase the branch. In magit r e master.
   6. now go back to master b b master.
   7. merge your branch into master: m m development.
   8. if all has gone well, you can push master to remote: P u.
   9. go back to your branch and do work.

Links:

- [[https://github.com/jkitchin/magit-tutorial][Magit Tutorial]]
- [[https://vickychijwani.me/magit-part-i/][Other Magit Tutorial part I]], [[https://vickychijwani.me/magit-part-ii/][Part II]]

*** COMPLETED Add gpg
    CLOSED: [2018-01-29 Mon 14:38]
   CLOCK: [2018-01-29 Mon 9:00]--[2018-01-29 Mon 10:32] =>  1:32
- added gpg key
- started branch

*** COMPLETED Test commits to branch
    CLOSED: [2018-01-29 Mon 14:38]
   CLOCK: [2018-01-29 Mon 10:32]--[2018-01-29 Mon 11:00] =>  0:28

Test branch by commits

*** COMPLETED Test verification
    CLOSED: [2018-01-29 Mon 14:39]
   CLOCK: [2018-01-29 Mon 11:00]--[2018-01-29 Mon 11:21] =>  0:21

Test key verification through commits

*** COMPLETED Add Travis support for project
    CLOSED: [2018-01-29 Mon 16:54]

Travis automatically builds your project every time you do a commit.

- Log in to travis using your github account (this has to be done by
  Niam): https://travis-ci.org/. Create a project for Football
  Manager.
- Create a file called .travis.yml on the top directory of your
  project. See [[https://ledentsov.de/2013/07/06/setting-travis-ci-with-github-for-a-c-project-for-the-first-time-cpp/][Setting travis-ci with github for a c++ project for the
  first time]]
- add an emblem to your readme file. This should appear on your travis
  project, as per article above.

*** COMPLETED Practice branches
    CLOSED: [2018-01-29 Mon 14:39]
   CLOCK: [2018-01-29 Mon 11:30]--[2018-01-29 Mon 12:35] =>  1:05

Change branch, commit, merge, push, repeat

*** COMPLETED Fix travis
    CLOSED: [2018-01-29 Mon 14:39]
    CLOCK: [2018-01-29 Mon 12:35]--[2018-01-29 Mon 13:08] =>  0:33

Changed travis.yml file - chnaged to master(branch).

*** COMPLETED Create a simple main for project                        :story:
    CLOSED: [2018-01-29 Mon 16:50]

Built program using main file, CMakeLists, and .travis.yml

*** COMPLETED Create main
    CLOSED: [2018-01-29 Mon 16:10]
    CLOCK: [2018-01-29 Mon 14:10]--[2018-01-29 Mon 14:36] =>  0:26

Create a main.cpp - output hello

*** COMPLETED Build main
    CLOSED: [2018-01-29 Mon 16:50]
    CLOCK: [2018-01-29 Mon 14:40]--[2018-01-29 Mon 16:50] =>  2:10

- move folders
- push, pull
- fix travis file

*** COMPLETED Discuss task
    CLOSED: [2018-01-30 Tue 10:31]
    CLOCK: [2018-01-30 Tue 10:00]--[2018-01-30 Tue 10:31] =>  0:31

*** COMPLETED Create a Menu class
    CLOSED: [2018-01-30 Tue 11:23]
    CLOCK: [2018-01-30 Tue 10:31]--[2018-01-30 Tue 11:23] =>  0:52

*** COMPLETED Fix menu class
    CLOSED: [2018-01-30 Tue 14:04]
    CLOCK: [2018-01-30 Tue 11:23]--[2018-01-30 Tue 13:04] =>  1:41

*** COMPLETED Research classes
    CLOSED: [2018-02-01 Thu 09:21]
    CLOCK: [2018-01-30 Tue 16:00]--[2018-01-30 Tue 16:27] =>  0:27
    CLOCK: [2018-01-30 Tue 14:04]--[2018-01-30 Tue 15:26] =>  1:22

*** COMPLETED Add new option to list
    CLOSED: [2018-01-30 Tue 15:46]
    CLOCK: [2018-01-30 Tue 15:27]--[2018-01-30 Tue 15:46] =>  0:19

*** COMPLETED Create players class
    CLOSED: [2018-01-30 Tue 16:50]
    CLOCK: [2018-01-30 Tue 16:28]--[2018-01-30 Tue 16:49] =>  0:21

*** POSTPONED Fix player class
    CLOSED: [2018-01-31 Wed 11:58]
    CLOCK: [2018-01-31 Wed 09:00]--[2018-01-31 Wed 11:00] =>  2.00

*** STARTED create setup function in player class
    CLOCK: [2018-01-31 Wed 11:00]--[2018-01-31 Wed 12:30] =>  1:30
*** STARTED create display function in player class
    CLOCK: [2018-01-31 Wed 13:30]--[2018-01-31 Wed 13:50] =>  0:20
add both functions to main

*** COMPLETED Create vector for players
    CLOSED: [2018-01-31 Wed 15:27]
    CLOCK: [2018-01-31 Wed 14:27]--[2018-01-31 Wed 15:27] =>  1:00
made a vector, which contained players, which are then displayed.
*** COMPLETED Read through fixed player class
    CLOSED: [2018-01-31 Wed 16:52]
    CLOCK: [2018-01-31 Wed 15:45]--[2018-01-31 Wed 16:52] =>  1:07
read through MCs changes
*** COMPLETED Research classes
    CLOSED: [2018-02-02 Fri 10:11]
    CLOCK: [2018-02-01 Thu 10:25]--[2018-02-01 Thu 12:00] =>  1:35
    CLOCK: [2018-02-01 Thu 09:00]--[2018-02-01 Thu 10:21] =>  1:21
www.learncpp.com
*** COMPLETED Dealing with conflicts in magit
    CLOSED: [2018-02-02 Fri 10:11]
    CLOCK: [2018-02-01 Thu 13:30]--[2018-02-01 Thu 15:49] =>  2:19
fixing git conflicts
*** COMPLETED Practice implementing class with functions
    CLOSED: [2018-02-01 Thu 16:26]
    CLOCK: [2018-02-01 Thu 16:00]--[2018-02-01 Thu 16:26] =>  0:26
implement the class and function from learncpp, and split it up into seperate files.

*** COMPLETED Research classes
    CLOSED: [2018-02-02 Fri 10:41]
    CLOCK: [2018-02-02 Fri 09:00]--[2018-02-02 Fri 10:41] =>  1:41
*** COMPLETED Add detail to players
    CLOSED: [2018-02-02 Fri 14:05]
    CLOCK: [2018-02-02 Fri 10:44]--[2018-02-02 Fri 11:44] =>  1:00
Made it so that it shows all player properties
*** COMPLETED Add new player
    CLOSED: [2018-02-02 Fri 14:06]
    CLOCK: [2018-02-02 Fri 11:44]--[2018-02-02 Fri 12:30] =>  0:46
Added a new player to the program using player class
*** COMPLETED Show detail of select player only
    CLOSED: [2018-02-02 Fri 14:36]
    CLOCK: [2018-02-02 Fri 14:07]--[2018-02-02 Fri 14:36] =>  0:29
when selecting a player only that players details are shown
*** COMPLETED Discuss task
    CLOSED: [2018-02-02 Fri 15:09]
    CLOCK: [2018-02-02 Fri 14:36]--[2018-02-02 Fri 15:09] =>  0:33
Discussing next task
*** COMPLETED Add the rest of the players
    CLOSED: [2018-02-02 Fri 15:51]
    CLOCK: [2018-02-02 Fri 15:12]--[2018-02-02 Fri 15:51] =>  0:39
Added the rest of the players that can be selected
*** COMPLETED Testing program
    CLOSED: [2018-02-05 Mon 09:12]
    CLOCK: [2018-02-02 Fri 16:00]--[2018-02-02 Fri 17:00] => 1:0
tested changes to program
*** COMPLETED Learning about pointers- videos
    CLOSED: [2018-02-05 Mon 14:10]
    CLOCK: [2018-02-05 Mon 09:00]--[2018-02-05 Mon 10:00] =>  1:00
  https://www.youtube.com/watch?v=W0aE-w61Cb8
  https://www.youtube.com/watch?v=CSVRA4_xOkw
*** COMPLETED Pointers - research
    CLOSED: [2018-02-05 Mon 14:12]
    CLOCK: [2018-02-05 Mon 10:00]--[2018-02-05 Mon 11:30] =>  1:30
 https://gist.github.com/ericandrewlewis/720c374c29bbafadedc9
 http://www.learncpp.com/cpp-tutorial/67-introduction-to-pointers/
 http://www.hellgeeks.com/pointers-in-c/
*** COMPLETED Pointers - tutorials
    CLOSED: [2018-02-05 Mon 14:14]
    CLOCK: [2018-02-05 Mon 11:30]--[2018-02-05 Mon 12:30] =>  1:00
 http://www.cplusplus.com/doc/tutorial/pointers/
 http://www.learncpp.com/cpp-tutorial/67-introduction-to-pointers/
*** COMPLETED Pointers - examples
    CLOSED: [2018-02-05 Mon 15:46]
    CLOCK: [2018-02-05 Mon 14:00]--[2018-02-05 Mon 14:45] =>  0:45
Researching program examples of pointers - best one:http://www.cplusplus.com/forum/beginner/8894/

*** COMPLETED Pointers - program
    CLOSED: [2018-02-05 Mon 15:47]
    CLOCK: [2018-02-05 Mon 15:00]--[2018-02-05 Mon 15:46] =>  0:46
Implemented program, showing how pointers work.
*** COMPLETED Testing program
    CLOSED: [2018-02-05 Mon 16:39]
    CLOCK: [2018-02-05 Mon 15:45]--[2018-02-05 Mon 16:30] =>  0:45
changing things in program to test
*** COMPLETED Discussing program
    CLOSED: [2018-02-06 Tue 10:28]
    CLOCK: [2018-02-05 Mon 16:30]--[2018-02-05 Mon 17:00] =>  0:30
Discussed program with PG
*** COMPLETED Review pointers
    CLOSED: [2018-02-06 Tue 10:29]
    CLOCK: [2018-02-06 Tue 09:00]--[2018-02-06 Tue 10:00] =>  1:00
Review previous work
*** COMPLETED Research pointers to data structures
    CLOSED: [2018-02-06 Tue 11:30]
    CLOCK: [2018-02-06 Tue 10:29]--[2018-02-06 Tue 11:30] =>  1:01
https://www.geeksforgeeks.org/overview-of-data-structures-set-1-linear-data-structures/
*** COMPLETED Pointers with array program
    CLOSED: [2018-02-06 Tue 12:26]
    CLOCK: [2018-02-06 Tue 11:30]--[2018-02-06 Tue 12:26] =>  0:56
mad a program which used a pointer to pint to an item in array
*** COMPLETED Data structures reading
    CLOSED: [2018-02-06 Tue 15:00]
    CLOCK: [2018-02-06 Tue 14:06]--[2018-02-06 Tue 15:00] =>  0:54
https://www.geeksforgeeks.org/data-structures/
*** COMPLETED Pointers and classes
    CLOSED: [2018-02-06 Tue 16:11]
    CLOCK: [2018-02-06 Tue 15:00]--[2018-02-06 Tue 16:00] =>  1:00
https://www.tutorialspoint.com/cplusplus/cpp_pointer_to_class.htm
*** COMPLETED Pointers and classes program
    CLOSED: [2018-02-06 Tue 16:45]
    CLOCK: [2018-02-06 Tue 16:11]--[2018-02-06 Tue 16:45] =>  0:34
made a program which used pointers to class obejects
*** COMPLETED Review
    CLOSED: [2018-02-07 Wed 09:44]
    CLOCK: [2018-02-07 Wed 09:00]--[2018-02-07 Wed 09:44] =>  0:44
Review previous work
*** COMPLETED Discussing tasks
    CLOSED: [2018-02-07 Wed 09:54]
    CLOCK: [2018-02-07 Wed 09:47]--[2018-02-07 Wed 09:54] =>  0:07
http://condor.depaul.edu/ntomuro/courses/309/notes/pointer_exercises.html
http://www.worldbestlearningcenter.com/index_files/cpp-pointers-exercises.htm
https://www.doc.ic.ac.uk/~wjk/c++Intro/RobMillerE7.html
http://www.tulane.edu/~mpuljic/cpp/savitch/chapter12
https://erlerobotics.gitbooks.io/erle-robotics-cpp-gitbook/pointers/exercises_pointers.html

*** COMPLETED Pointers practice
    CLOSED: [2018-02-07 Wed 11:07]
    CLOCK: [2018-02-07 Wed 09:56]--[2018-02-07 Wed 11:07] =>  1:11
http://www.worldbestlearningcenter.com/index_files/cpp-pointers-exercises.htm
*** COMPLETED Pointers, classes, - employee program
    CLOSED: [2018-02-07 Wed 12:15]
    CLOCK: [2018-02-07 Wed 11:19]--[2018-02-07 Wed 12:15] =>  0:56
made employee program
*** COMPLETED Split employee program up
    CLOSED: [2018-02-07 Wed 14:44]
    CLOCK: [2018-02-07 Wed 13:30]--[2018-02-07 Wed 14:44] =>  1:14
split up previous program into translation units

*** COMPLETED Looking at PGs program
    CLOSED: [2018-02-07 Wed 15:13]
    CLOCK: [2018-02-07 Wed 14:45]--[2018-02-07 Wed 15:13] =>  0:28
Looked at  PGs program/errors
*** COMPLETED Testing employee program
    CLOSED: [2018-02-07 Wed 16:18]
    CLOCK: [2018-02-07 Wed 15:14]--[2018-02-07 Wed 16:18] =>  1:04
Tested employee program, to check if it works.
*** COMPLETED comparing w/ PG
    CLOSED: [2018-02-07 Wed 16:36]
    CLOCK: [2018-02-07 Wed 16:22]--[2018-02-07 Wed 16:45] =>  0:23
comparing code
*** COMPLETED Add another function to employee program
    CLOSED: [2018-02-08 Thu 10:10]
    CLOCK: [2018-02-08 Thu 09:00]--[2018-02-08 Thu 10:09] =>  1:09
Adding tax function
*** COMPLETED Research class constructors
    CLOSED: [2018-02-08 Thu 11:35]
    CLOCK: [2018-02-08 Thu 10:15]--[2018-02-08 Thu 11:15] =>  1:00
Researching class constructors
*** COMPLETED Help PG split files
    CLOSED: [2018-02-08 Thu 11:59]
    CLOCK: [2018-02-08 Thu 11:30]--[2018-02-08 Thu 11:58] =>  0:28

*** COMPLETED Class constructor and multiple files Video
    CLOSED: [2018-02-08 Thu 14:15]
    CLOCK: [2018-02-08 Thu 12:06]--[2018-02-08 Thu 13:00] =>  0:54
https://www.youtube.com/watch?v=CT2k4KbAQpo
*** COMPLETED Make another object
    CLOSED: [2018-02-08 Thu 14:23]
    CLOCK: [2018-02-08 Thu 14:00]--[2018-02-08 Thu 14:23] =>  0:23
Add object to program
*** COMPLETED Allow user to add employee/object
    CLOSED: [2018-02-08 Thu 15:21]
    CLOCK: [2018-02-08 Thu 14:25]--[2018-02-08 Thu 15:21] =>  0:56
Use user input to create object
*** COMPLETED Discuss tasks
    CLOSED: [2018-02-08 Thu 16:38]
    CLOCK: [2018-02-08 Thu 15:30]--[2018-02-08 Thu 16:00] =>  0:30

*** COMPLETED Research tasks
    CLOSED: [2018-02-09 Fri 09:36]
    CLOCK: [2018-02-09 Fri 09:00]--[2018-02-09 Fri 09:36] =>  0:36

*** COMPLETED Watch classes video
    CLOSED: [2018-02-09 Fri 10:53]
    CLOCK: [2018-02-09 Fri 09:37]--[2018-02-09 Fri 10:30] =>  0:53
https://www.youtube.com/watch?v=b9wialxvcVA
*** COMPLETED Employee IO program
    CLOSED: [2018-02-09 Fri 14:37]
    CLOCK: [2018-02-09 Fri 10:53]--[2018-02-09 Fri 11:56] =>  1:03
Read/write employee records
*** COMPLETED Test Employee IO program
    CLOSED: [2018-02-09 Fri 14:39]
    CLOCK: [2018-02-09 Fri 12:00]--[2018-02-09 Fri 13:00] =>  1:00
Test read write function
*** COMPLETED Review player class in FM
    CLOSED: [2018-02-09 Fri 15:09]
    CLOCK: [2018-02-09 Fri 14:30]--[2018-02-09 Fri 15:08] =>  0:38

*** COMPLETED Discuss tasks
    CLOSED: [2018-02-09 Fri 15:21]
    CLOCK: [2018-02-09 Fri 15:08]--[2018-02-09 Fri 15:21] =>  0:13

*** COMPLETED Discuss code
    CLOSED: [2018-02-09 Fri 16:38]
    CLOCK: [2018-02-09 Fri 15:40]--[2018-02-09 Fri 16:20] =>  0:40

*** COMPLETED Read about Object oriented programming
    CLOSED: [2018-02-12 Mon 09:42]
    CLOCK: [2018-02-12 Mon 09:00]--[2018-02-12 Mon 09:42] =>  0:42
learncpp.com
*** COMPLETED Start league class
    CLOSED: [2018-02-12 Mon 10:40]
    CLOCK: [2018-02-12 Mon 09:52]--[2018-02-12 Mon 10:40] =>  0:48
started creating class for  leagues
*** COMPLETED Add league class to main
    CLOSED: [2018-02-12 Mon 11:10]
    CLOCK: [2018-02-12 Mon 10:40]--[2018-02-12 Mon 11:10] =>  0:30
Added league class to main

*** COMPLETED Discuss tasks
    CLOSED: [2018-02-12 Mon 12:24]
    CLOCK: [2018-02-12 Mon 11:15]--[2018-02-12 Mon 11:45] =>  0:30

*** COMPLETED Review changes
    CLOSED: [2018-02-12 Mon 12:25]
    CLOCK: [2018-02-12 Mon 13:49]--[2018-02-12 Mon 14:20] =>  0:31
    CLOCK: [2018-02-12 Mon 11:50]--[2018-02-12 Mon 12:25] =>  0:35
Look at changes made
*** COMPLETED Add more team data to league
    CLOSED: [2018-02-12 Mon 15:22]
    CLOCK: [2018-02-12 Mon 14:45]--[2018-02-12 Mon 15:22] =>  0:37
Added more teams to league
*** COMPLETED Testing
    CLOSED: [2018-02-12 Mon 16:27]
    CLOCK: [2018-02-12 Mon 15:25]--[2018-02-12 Mon 16:27] =>  1:02

*** COMPLETED Review code/research tasks
    CLOSED: [2018-02-13 Tue 10:05]
    CLOCK: [2018-02-13 Tue 09:04]--[2018-02-13 Tue 10:05] =>  1:01

*** COMPLETED Start game class
    CLOSED: [2018-02-13 Tue 11:05]
    CLOCK: [2018-02-13 Tue 10:05]--[2018-02-13 Tue 11:05] =>  1:00
Started creating class for game/match
*** COMPLETED Discuss game and look through code
    CLOSED: [2018-02-13 Tue 11:53]
    CLOCK: [2018-02-13 Tue 11:53]--[2018-02-13 Tue 12:29] =>  0:36
    CLOCK: [2018-02-13 Tue 11:10]--[2018-02-13 Tue 11:53] =>  0:43

*** COMPLETED Add game to main
    CLOSED: [2018-02-13 Tue 13:58]
    CLOCK: [2018-02-13 Tue 12:37]--[2018-02-13 Tue 13:00] =>  0:23
Added game class to main
*** COMPLETED Read MC sample game
    CLOSED: [2018-02-13 Tue 14:44]
    CLOCK: [2018-02-13 Tue 14:19]--[2018-02-13 Tue 14:44] =>  0:25

*** COMPLETED Build and test MC game
    CLOSED: [2018-02-13 Tue 16:33]
    CLOCK: [2018-02-13 Tue 14:45]--[2018-02-13 Tue 15:45] =>  1:00

*** COMPLETED Research parts of code
    CLOSED: [2018-02-13 Tue 16:33]
    CLOCK: [2018-02-13 Tue 16:00]--[2018-02-13 Tue 16:33] =>  0:33

*** COMPLETED Research IO/Myfile
    CLOSED: [2018-02-14 Wed 10:10]
    CLOCK: [2018-02-14 Wed 09:30]--[2018-02-14 Wed 10:10] =>  0:40

*** COMPLETED Review sample program
    CLOSED: [2018-02-14 Wed 13:06]
    CLOCK: [2018-02-14 Wed 10:15]--[2018-02-14 Wed 12:15] =>  2:00
-Review program
-Breakdown code
-test code/changes
-research certain parts of code_
*** COMPLETED Fix league class
    CLOSED: [2018-02-14 Wed 13:07]
    CLOCK: [2018-02-14 Wed 12:15]--[2018-02-14 Wed 13:06] =>  0:51
-Change class to make it like sample
*** COMPLETED Check through program for errors
    CLOSED: [2018-02-14 Wed 16:49]
    CLOCK: [2018-02-14 Wed 14:00]--[2018-02-14 Wed 15:00] =>  1:00
-errors in main: extra curly
-errors in league: stray .
*** COMPLETED Practice IO
    CLOSED: [2018-02-14 Wed 16:50]
    CLOCK: [2018-02-14 Wed 15:20]--[2018-02-14 Wed 16:20] =>  1:00

*** COMPLETED Fix league
    CLOSED: [2018-02-15 Thu 10:08]
    CLOCK: [2018-02-15 Thu 09:15]--[2018-02-15 Thu 10:08] =>  0:53
-- Missing bracket at end
*** COMPLETED Look through sample main
    CLOSED: [2018-02-15 Thu 11:05]
    CLOCK: [2018-02-15 Thu 10:20]--[2018-02-15 Thu 11:05] =>  0:45

** Deprecated
